ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_erad_regs.xml
<module id="ERAD_REGS" HW_revision="" description="ERAD Registers">
	<group id="ERAD_EBC_REGS" name="ERAD_EBC_REGS" instances="8" offset="0x40" instaddr="64">
		<register id="EBC_OWNER" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="EBC Owner Register">
			<bitfield id="OWNER" description="Ownership ID" begin="1" end="0" width="2" rwaccess="RW"/>
			<bitfield id="ZONE" description="Zone ID" begin="11" end="8" width="4" rwaccess="R"/>
			<bitfield id="SROOT" description="SROOT LINK ownership" begin="12" end="12" width="1" rwaccess="R"/>
			<bitfield id="SEM" description="Semaphore" begin="16" end="16" width="1" rwaccess="R"/>
			<bitfield id="CONFIG" description="Configuration" begin="18" end="17" width="2" rwaccess="R"/>
		</register>
		<register id="EBC_CNTL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="EBC Control Register">
			<bitfield id="EN" description="Enable" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="BUS_SEL" description="Bus select bits" begin="5" end="1" width="5" rwaccess="RW"/>
			<bitfield id="HALT" description="CPU Halt" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="INTERRUPT" description="Interrupt enable" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="NMI_EN" description="NMI enable" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="COMP_MODE" description="Compare mode" begin="11" end="9" width="3" rwaccess="RW"/>
			<bitfield id="STACK_QUAL" description="Stack access qualifier" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="SPSEL_MATCH_EN" description="SPSEL match enable" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="SPSEL" description="SPSEL" begin="17" end="14" width="4" rwaccess="RW"/>
		</register>
		<register id="EBC_STATUS" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="EBC Status Register">
			<bitfield id="EVENT_FIRED" description="EBC Event Fired bits" begin="0" end="0" width="1" rwaccess="R"/>
			<bitfield id="STATUS" description="Status bits" begin="9" end="8" width="2" rwaccess="R"/>
		</register>
		<register id="EBC_STATUSCLEAR" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="EBC Clear Register">
			<bitfield id="EVENT_FIRED" description="Event Clear register" begin="0" end="0" width="1" rwaccess="RW"/>
		</register>
		<register id="EBC_REFL" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="EBC Reference Low Register">
			<bitfield id="REF" description="Compare low reference register" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="EBC_REFH" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="EBC Reference High Register">
			<bitfield id="REF" description="Compare high reference register" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="EBC_MASKL" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="EBC Mask Low Register">
			<bitfield id="MASK" description="Compare low mask register" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="EBC_MASKH" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="EBC Mask High Register">
			<bitfield id="MASK" description="Compare high mask register" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="EBC_WP_PC" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="EBC Watchpoint PC Register">
			<bitfield id="PC" description="Watchpoint PC Register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
	</group>
	<group id="ERAD_SEC_REGS" name="ERAD_SEC_REGS" instances="4" offset="0x440" instaddr="64">
		<register id="SEC_OWNER" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="SEC Owner Register">
			<bitfield id="OWNER" description="Ownership ID" begin="1" end="0" width="2" rwaccess="RW"/>
			<bitfield id="ZONE" description="Zone ID" begin="11" end="8" width="4" rwaccess="R"/>
			<bitfield id="SROOT" description="SROOT LINK ownership" begin="12" end="12" width="1" rwaccess="R"/>
			<bitfield id="SEM" description="Semaphore" begin="16" end="16" width="1" rwaccess="R"/>
			<bitfield id="CONFIG" description="Configuration" begin="18" end="17" width="2" rwaccess="R"/>
		</register>
		<register id="SEC_CNTL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="SEC Control Register">
			<bitfield id="EN" description="Enable" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="EDGE_LEVEL" description="Event mode bit" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="START_STOP_MODE" description="Start_stop mode bit" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="START_STOP_CUMULATIVE" description="Start stop cumulative bit" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="RST_ON_MATCH" description="Reset_on_match bit" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="HALT" description="CPU Halt" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="INTERRUPT" description="Interrupt enable" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="NMI_EN" description="NMI enable" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="CNT_INP_SEL_EN" description="Counter input select enable" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="RST_INP_SEL_EN" description="Counter reset input select enable" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="FREE_RUN" description="counter behaviour on CPU Halt" begin="10" end="10" width="1" rwaccess="RW"/>
		</register>
		<register id="SEC_STATUS" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="SEC Status Register">
			<bitfield id="EVENT_FIRED" description="Counter Event Fired bits" begin="0" end="0" width="1" rwaccess="R"/>
			<bitfield id="OVERFLOW" description="Counter Overflowed" begin="1" end="1" width="1" rwaccess="R"/>
			<bitfield id="STATUS" description="Status bits" begin="9" end="8" width="2" rwaccess="R"/>
		</register>
		<register id="SEC_STATUSCLEAR" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="SEC Clear Register">
			<bitfield id="EVENT_FIRED" description="Clear EVENT_FIRED" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="OVERFLOW" description="Clear OVERFLOW" begin="1" end="1" width="1" rwaccess="RW"/>
		</register>
		<register id="SEC_REF" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="SEC Reference Register">
			<bitfield id="REF" description="Counter reference/compare register" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="SEC_INPUT_SEL1" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="SEC Input Select Register1">
			<bitfield id="CNT_INP_SEL" description="Counter Input Select" begin="7" end="0" width="8" rwaccess="RW"/>
			<bitfield id="RST_INP_SEL" description="Counter Reset input Select" begin="23" end="16" width="8" rwaccess="RW"/>
		</register>
		<register id="SEC_INPUT_SEL2" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="SEC Input Select Register2">
			<bitfield id="STA_INP_SEL" description="Counter Sart Input Select" begin="7" end="0" width="8" rwaccess="RW"/>
			<bitfield id="STO_INP_SEL" description="Counter Stop Input Select" begin="23" end="16" width="8" rwaccess="RW"/>
		</register>
		<register id="SEC_INPUT_COND" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="SEC Input Conditioning Register">
			<bitfield id="SEC_INP_INV" description="Counter Input Invert" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="STA_INP_INV" description="Start input Invert" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="STO_INP_INV" description="Stop input Invert" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="RST_INP_INV" description="Reset input Invert" begin="12" end="12" width="1" rwaccess="RW"/>
		</register>
		<register id="SEC_COUNT" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="SEC Counter Register">
			<bitfield id="COUNT" description="The counter value register" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="SEC_MAX_COUNT" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="SEC Max Count Register">
			<bitfield id="MAX_COUNT" description="The maximum recorded counter value." begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="SEC_MIN_COUNT" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="SEC Min Count Register">
			<bitfield id="MIN_COUNT" description="The minimum recorded counter value." begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
	</group>
	<group id="ERAD_AND_REGS" name="ERAD_AND_REGS" instances="4" offset="0x640" instaddr="32">
		<register id="AND_MASK_OWNER" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="AND Owner Register">
			<bitfield id="OWNER" description="Ownership ID" begin="1" end="0" width="2" rwaccess="RW"/>
			<bitfield id="ZONE" description="Zone ID" begin="11" end="8" width="4" rwaccess="R"/>
			<bitfield id="SROOT" description="SROOT LINK ownership" begin="12" end="12" width="1" rwaccess="R"/>
			<bitfield id="SEM" description="Semaphore" begin="16" end="16" width="1" rwaccess="R"/>
		</register>
		<register id="AND_MASK_CTL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="AND Control Register">
			<bitfield id="HALT" description="CPU Halt" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="INTERRUPT" description="Interrupt enable" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="NMI_EN" description="NMI enable" begin="2" end="2" width="1" rwaccess="RW"/>
		</register>
		<register id="EVENT_AND_MASK" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="AND Event Selection Register">
			<bitfield id="MASK_EBC" description="EBC, SEC AND Event Mask" begin="23" end="0" width="24" rwaccess="RW"/>
		</register>
	</group>
	<group id="ERAD_OR_REGS" name="ERAD_OR_REGS" instances="4" offset="0x740" instaddr="32">
		<register id="OR_MASK_OWNER" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="OR Owner Register">
			<bitfield id="OWNER" description="Ownership ID" begin="1" end="0" width="2" rwaccess="RW"/>
			<bitfield id="ZONE" description="Zone ID" begin="11" end="8" width="4" rwaccess="R"/>
			<bitfield id="SROOT" description="SROOT LINK ownership" begin="12" end="12" width="1" rwaccess="R"/>
			<bitfield id="SEM" description="Semaphore" begin="16" end="16" width="1" rwaccess="R"/>
		</register>
		<register id="OR_MASK_CTL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="OR Control Register">
			<bitfield id="HALT" description="CPU Halt" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="INTERRUPT" description="Interrupt enable" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="NMI_EN" description="NMI enable" begin="2" end="2" width="1" rwaccess="RW"/>
		</register>
		<register id="EVENT_OR_MASK" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="OR Event Selection Register">
			<bitfield id="MASK_EBC" description="EBC, SEC OR Event Mask" begin="23" end="0" width="24" rwaccess="RW"/>
		</register>
	</group>
	<register id="GLBL_ERAD_ID" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Debug Peripheral ID">
		<bitfield id="MINOR" description="Minor" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="Custom" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="FUNC" description="Func" begin="27" end="16" width="12" rwaccess="R"/>
	</register>
	<register id="GLBL_EVENT_STAT" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Global Event Status Register">
		<bitfield id="EBC" description="EBC Module Event Status" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SEC" description="SEC Module Event Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="PCTRACE_OWNER" width="32" page="0" offset="0x840" instances="1" instaddr="4" internal="0" description="Owner Register">
		<bitfield id="OWNER" description="Ownership ID" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="ZONE" description="Zone ID" begin="11" end="8" width="4" rwaccess="R"/>
		<bitfield id="SROOT" description="SROOT LINK ownership" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SEM" description="Semaphore" begin="16" end="16" width="1" rwaccess="R"/>
	</register>
	<register id="PCTRACE_GLOBAL" width="32" page="0" offset="0x844" instances="1" instaddr="4" internal="0" description="Global Control Register">
		<bitfield id="EN" description="Enable PC  trace" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT" description="Initialize the PC Trace and buffer pointer" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="BUFFER_SIZE" description="Trace buffer size" begin="17" end="16" width="2" rwaccess="R"/>
	</register>
	<register id="PCTRACE_BUFFER" width="32" page="0" offset="0x848" instances="1" instaddr="4" internal="0" description="Trace Buffer pointer register">
		<bitfield id="PTR" description="Trace Buffer Pointer" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="BUFFER_FULL" description="Trace Buffer Full" begin="16" end="16" width="1" rwaccess="R"/>
	</register>
	<register id="PCTRACE_QUAL1" width="32" page="0" offset="0x84c" instances="1" instaddr="4" internal="0" description="Trace Qualifier register 1">
		<bitfield id="WINDOWED_INP_SEL" description="Windowed trace qualifier" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="TRACE_MODE" description="Trace qualifier mode" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="WINDOWED_INP_INV" description="Windowed trace Input Invert" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="START_INP_INV" description="Start input Invert" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="STOP_INP_INV" description="Stop input Invert" begin="22" end="22" width="1" rwaccess="RW"/>
	</register>
	<register id="PCTRACE_QUAL2" width="32" page="0" offset="0x850" instances="1" instaddr="4" internal="0" description="Trace Qualifier register 2">
		<bitfield id="START_INP_SEL" description="Trace Start event select" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="STOP_INP_SEL" description="Trace Stop event select" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="PCTRACE_LOGPC_SOFTENABLE" width="32" page="0" offset="0x854" instances="1" instaddr="4" internal="0" description="PC when PC Trace was last enabled by software">
		<bitfield id="PC_SOFTENABLE" description="PC when PC Trace was last enabled by software" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PCTRACE_LOGPC_SOFTDISABLE" width="32" page="0" offset="0x858" instances="1" instaddr="4" internal="0" description="PC when PC Trace was last disabled by software">
		<bitfield id="PC_SOFTDISABLE" description="PC when PC Trace was last disabled by software" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PCTRACE_BUFFER_BASE" width="32" page="0" offset="0x1000" instances="256" instaddr="4" internal="0" description="Trace Buffer Base address">
		<bitfield id="BLOCKED" description="Access blocked due to security" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PROGRAM_COUNTER" description="Program Counter" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
</module>
